file/
  в”њв”Ђ line_comment = "// Principle #14: type references wrap their name in a <name> child."
  в”њв”Ђ line_comment = "// Covers: primitive types, paths, generic types, reference types,"
  в”њв”Ђ line_comment = "// type parameter declarations with <extends> bounds."
  в”њв”Ђ use/
  в”‚   в”њв”Ђ "use"
  в”‚   в”њв”Ђ path/
  в”‚   в”‚   в”њв”Ђ path/
  в”‚   в”‚   в”‚   в”њв”Ђ name = "std"
  в”‚   в”‚   в”‚   в”њв”Ђ "::"
  в”‚   в”‚   в”‚   в””в”Ђ name = "collections"
  в”‚   в”‚   в”њв”Ђ "::"
  в”‚   в”‚   в””в”Ђ name = "HashMap"
  в”‚   в””в”Ђ ";"
  в”њв”Ђ trait[private]/
  в”‚   в”њв”Ђ "trait"
  в”‚   в”њв”Ђ name = "Barker"
  в”‚   в””в”Ђ body/
  в”‚       в”њв”Ђ "{"
  в”‚       в”њв”Ђ function_signature_item/
  в”‚       в”‚   в”њв”Ђ "fn"
  в”‚       в”‚   в”њв”Ђ name = "bark"
  в”‚       в”‚   в”њв”Ђ "("
  в”‚       в”‚   в”њв”Ђ self/
  в”‚       в”‚   в”‚   в”њв”Ђ "&"
  в”‚       в”‚   в”‚   в””в”Ђ self = "self"
  в”‚       в”‚   в””в”Ђ ");"
  в”‚       в””в”Ђ "}"
  в”њв”Ђ struct[private]/
  в”‚   в”њв”Ђ "struct"
  в”‚   в”њв”Ђ name = "Dog"
  в”‚   в”њв”Ђ "<"
  в”‚   в”њв”Ђ generic/
  в”‚   в”‚   в”њв”Ђ name = "T"
  в”‚   в”‚   в””в”Ђ bounds/
  в”‚   в”‚       в”њв”Ђ ":"
  в”‚   в”‚       в””в”Ђ type/name = "Barker"
  в”‚   в”њв”Ђ ">"
  в”‚   в””в”Ђ body/
  в”‚       в”њв”Ђ "{"
  в”‚       в”њв”Ђ field/
  в”‚       в”‚   в”њв”Ђ name = "owner"
  в”‚       в”‚   в”њв”Ђ ":"
  в”‚       в”‚   в””в”Ђ type/name = "T"
  в”‚       в”њв”Ђ ","
  в”‚       в”њв”Ђ field/
  в”‚       в”‚   в”њв”Ђ name = "tags"
  в”‚       в”‚   в”њв”Ђ ":"
  в”‚       в”‚   в””в”Ђ type[generic]/
  в”‚       в”‚       в”њв”Ђ name = "Vec"
  в”‚       в”‚       в”њв”Ђ "<"
  в”‚       в”‚       в”њв”Ђ type/name = "String"
  в”‚       в”‚       в””в”Ђ ">"
  в”‚       в”њв”Ђ ","
  в”‚       в”њв”Ђ field/
  в”‚       в”‚   в”њв”Ђ name = "scores"
  в”‚       в”‚   в”њв”Ђ ":"
  в”‚       в”‚   в””в”Ђ type[generic]/
  в”‚       в”‚       в”њв”Ђ name = "HashMap"
  в”‚       в”‚       в”њв”Ђ "<"
  в”‚       в”‚       в”њв”Ђ type/name = "String"
  в”‚       в”‚       в”њв”Ђ ","
  в”‚       в”‚       в”њв”Ђ type/name = "i32"
  в”‚       в”‚       в””в”Ђ ">"
  в”‚       в”њв”Ђ ","
  в”‚       в”њв”Ђ field/
  в”‚       в”‚   в”њв”Ђ name = "parent"
  в”‚       в”‚   в”њв”Ђ ":"
  в”‚       в”‚   в””в”Ђ type[generic]/
  в”‚       в”‚       в”њв”Ђ name = "Option"
  в”‚       в”‚       в”њв”Ђ "<"
  в”‚       в”‚       в”њв”Ђ type[generic]/
  в”‚       в”‚       в”‚   в”њв”Ђ name = "Box"
  в”‚       в”‚       в”‚   в”њв”Ђ "<"
  в”‚       в”‚       в”‚   в”њв”Ђ type[generic]/
  в”‚       в”‚       в”‚   в”‚   в”њв”Ђ name = "Dog"
  в”‚       в”‚       в”‚   в”‚   в”њв”Ђ "<"
  в”‚       в”‚       в”‚   в”‚   в”њв”Ђ type/name = "T"
  в”‚       в”‚       в”‚   в”‚   в””в”Ђ ">"
  в”‚       в”‚       в”‚   в””в”Ђ ">"
  в”‚       в”‚       в””в”Ђ ">"
  в”‚       в””в”Ђ ",\n}"
  в””в”Ђ impl/
      в”њв”Ђ "impl<"
      в”њв”Ђ generic/
      в”‚   в”њв”Ђ name = "T"
      в”‚   в””в”Ђ bounds/
      в”‚       в”њв”Ђ ":"
      в”‚       в””в”Ђ type/name = "Barker"
      в”њв”Ђ ">"
      в”њв”Ђ type/name = "Barker"
      в”њв”Ђ "for"
      в”њв”Ђ type[generic]/
      в”‚   в”њв”Ђ name = "Dog"
      в”‚   в”њв”Ђ "<"
      в”‚   в”њв”Ђ type/name = "T"
      в”‚   в””в”Ђ ">"
      в””в”Ђ body/
          в”њв”Ђ "{"
          в”њв”Ђ function[private]/
          в”‚   в”њв”Ђ "fn"
          в”‚   в”њв”Ђ name = "bark"
          в”‚   в”њв”Ђ "("
          в”‚   в”њв”Ђ self/
          в”‚   в”‚   в”њв”Ђ "&"
          в”‚   в”‚   в””в”Ђ self = "self"
          в”‚   в”њв”Ђ ")"
          в”‚   в””в”Ђ body = "{}"
          в””в”Ђ "}"
