program/
  в”њв”Ђ line_comment = "// Principle #14: type references wrap their name in a <name> child."
  в”њв”Ђ line_comment = "// Covers: plain types, generic types, array types, extends/implements,"
  в”њв”Ђ line_comment = "// type parameter declarations with <extends> bounds."
  в”њв”Ђ import/
  в”‚   в”њв”Ђ "import"
  в”‚   в”њв”Ђ path/
  в”‚   в”‚   в”њв”Ђ path/
  в”‚   в”‚   в”‚   в”њв”Ђ name = "java"
  в”‚   в”‚   в”‚   в”њв”Ђ "."
  в”‚   в”‚   в”‚   в””в”Ђ name = "util"
  в”‚   в”‚   в”њв”Ђ "."
  в”‚   в”‚   в””в”Ђ name = "List"
  в”‚   в””в”Ђ ";"
  в”њв”Ђ class[package]/
  в”‚   в”њв”Ђ "class"
  в”‚   в”њв”Ђ name = "Animal"
  в”‚   в””в”Ђ body = "{}"
  в”њв”Ђ interface[package]/
  в”‚   в”њв”Ђ "interface"
  в”‚   в”њв”Ђ name = "Barker"
  в”‚   в””в”Ђ body/
  в”‚       в”њв”Ђ "{"
  в”‚       в”њв”Ђ method[public]/
  в”‚       в”‚   в”њв”Ђ returns/type/name = "void"
  в”‚       в”‚   в”њв”Ђ name = "bark"
  в”‚       в”‚   в””в”Ђ "();"
  в”‚       в””в”Ђ "}"
  в”њв”Ђ interface[package]/
  в”‚   в”њв”Ђ "interface"
  в”‚   в”њв”Ђ name = "Runner"
  в”‚   в””в”Ђ body/
  в”‚       в”њв”Ђ "{"
  в”‚       в”њв”Ђ method[public]/
  в”‚       в”‚   в”њв”Ђ returns/type/name = "void"
  в”‚       в”‚   в”њв”Ђ name = "run"
  в”‚       в”‚   в””в”Ђ "();"
  в”‚       в””в”Ђ "}"
  в””в”Ђ class[package]/
      в”њв”Ђ "class"
      в”њв”Ђ name = "Dog"
      в”њв”Ђ "<"
      в”њв”Ђ generic/
      в”‚   в”њв”Ђ name = "T"
      в”‚   в””в”Ђ bound/
      в”‚       в”њв”Ђ "extends"
      в”‚       в””в”Ђ type/name = "Animal"
      в”њв”Ђ ">"
      в”њв”Ђ extends/
      в”‚   в”њв”Ђ "extends"
      в”‚   в””в”Ђ type/name = "Animal"
      в”њв”Ђ implements/
      в”‚   в”њв”Ђ "implements"
      в”‚   в”њв”Ђ type/name = "Barker"
      в”‚   в”њв”Ђ ","
      в”‚   в””в”Ђ type/name = "Runner"
      в””в”Ђ body/
          в”њв”Ђ "{"
          в”њв”Ђ field[package]/
          в”‚   в”њв”Ђ type/name = "T"
          в”‚   в”њв”Ђ variable_declarator/name = "owner"
          в”‚   в””в”Ђ ";"
          в”њв”Ђ field[package]/
          в”‚   в”њв”Ђ type[generic]/
          в”‚   в”‚   в”њв”Ђ name = "List"
          в”‚   в”‚   в”њв”Ђ "<"
          в”‚   в”‚   в”њв”Ђ type/name = "String"
          в”‚   в”‚   в””в”Ђ ">"
          в”‚   в”њв”Ђ variable_declarator/name = "tags"
          в”‚   в””в”Ђ ";"
          в”њв”Ђ method[public]/
          в”‚   в”њв”Ђ returns/type/name = "void"
          в”‚   в”њв”Ђ name = "bark"
          в”‚   в”њв”Ђ "()"
          в”‚   в””в”Ђ body = "{}"
          в”њв”Ђ method[public]/
          в”‚   в”њв”Ђ returns/type/name = "void"
          в”‚   в”њв”Ђ name = "run"
          в”‚   в”њв”Ђ "()"
          в”‚   в””в”Ђ body = "{}"
          в””в”Ђ "}"
